Documents/ЗаявкаНаПодборПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПодборПерсонала</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаПодборПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метро</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Потребности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обеспечение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПользователиПоЦФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПользователиПоЦФО</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РуководительОтдела</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаявокНаПодборПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаПодборПерсонала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обеспечена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СотрудникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СотрудникиОрганизаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботуВКомпанию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольненияИзКомпании</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УинВЗупе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаявкаНаПодборПерсонала/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьОсновныеПараметрыФормы();
	
	ОбновитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтборыОбеспечения();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаЦФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Обработка.ГрафикРаботыГрузчиков.Форма.ФормаВыбораСтруктурнойЕдиницы", Новый Структура("НаименованиеГруппы", "Управление розницей."),,
				Элементы.ГруппаЦФО, ВариантОткрытияОкна.ОтдельноеОкно,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПотребности

&НаКлиенте
Процедура ПотребностиДолжностьАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДолжностьПоЧастиТекста(Текст);

КонецПроцедуры

&НаКлиенте
Процедура ПотребностиДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяДолжность = ВыбранноеЗначение; 
	ОбновитьОтборыОбеспечения(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотребностиПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьОтборыОбеспеченияОбработчик", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотребностиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьОтборыОбеспечения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбеспечение
&НаКлиенте
Процедура ОбеспечениеСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыбор", ЭтаФорма);
		
	ОткрытьФорму("Документ.ЗаявкаНаПодборПерсонала.Форма.ФормаВыбораФизЛица", Новый Структура("Отбор, ЗакрыватьПриВыборе", Новый Структура("Должность", ТекущаяДолжность), Истина),
		  ЭтаФорма.УникальныйИдентификатор,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		  
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбор(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		ТекущиеДанные = Элементы.Обеспечение.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда 
			ТекущиеДанные.Сотрудник = Результат.Ссылка;
			ТекущиеДанные.Должность = ТекущаяДолжность;
			Элементы.Обеспечение.ЗакончитьРедактированиеСтроки(Ложь); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечениеСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьФизЛицоПоЧастиТекста(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечениеСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Обеспечение.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Сотрудник = ВыбранноеЗначение;
		ТекущиеДанные.Должность = ТекущаяДолжность;
		Элементы.Обеспечение.ЗакончитьРедактированиеСтроки(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечениеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ОбновитьКоличествоОбеспеченияПодвал();

КонецПроцедуры

&НаКлиенте
Процедура ОбеспечениеПослеУдаления(Элемент)
	
	ОбновитьКоличествоОбеспеченияПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.Потребности.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Заполните таблицу потребностей!");
		Отказ = Истина;
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяДолжность) Тогда
		ПоказатьПредупреждение(, "Активируйте строку с должностью!");
		Отказ = Истина;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяДолжность) И НЕ ЗначениеЗаполнено(КоличествоПотребность) Тогда
		ПоказатьПредупреждение(,СтрЗаменить("Укажите количество сотрудников в таблице потребностей по должности ТекущаяДолжность!", "ТекущаяДолжность", ТекущаяДолжность));
		Отказ = Истина;	
	ИначеЕсли  КоличествоПотребность <= КоличествоОбеспечение Тогда
		ПоказатьПредупреждение(,СтрЗаменить("Потребность в сотрудниках с должностью ТекущаяДолжность уже обеспечена!", "ТекущаяДолжность", ТекущаяДолжность));
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОсновныеПараметрыФормы()

	//Заполнение нового документа
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.ГруппаЦФО = РегистрыСведений.ПользователиПоЦФО.ПолучитьСтрукрутуПодчиненияТекущегоСотрудника(Объект.Ответственный, Ложь, Истина);
		КонецЕсли;
		Объект.Статус = Перечисления.СтатусыЗаявокНаПодборПерсонала.Новая;
	КонецЕсли;
	
	//Заполнение прочих параметров
	ОбновитьСписокВыбораДолжностей();
	
КонецПроцедуры // ЗаполнитьОсновныеПараметрыФормы()

&НаСервере
Процедура ОбновитьСписокВыбораДолжностей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Должность КАК Значение,
	|	ФизическиеЛица.Должность КАК Представление
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО СотрудникиОрганизаций.Физлицо = ФизическиеЛица.Ссылка
	|ГДЕ
	|	СотрудникиОрганизаций.ДатаУвольнения = &ПустаяДата
	|	И НЕ СотрудникиОрганизаций.ПометкаУдаления
	|	И ФизическиеЛица.Активный
	|
	|СГРУППИРОВАТЬ ПО
	|	ФизическиеЛица.Должность
	|
	|УПОРЯДОЧИТЬ ПО
	|	Должность";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	
	Результат = Запрос.Выполнить();
	
	СписокВыбораДолжностей = Новый СписокЗначений();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Элементы.Потребности.ПодчиненныеЭлементы.ПотребностиДолжность.СписокВыбора.Добавить(Выборка.Значение, СокрЛП(Выборка.Представление));
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДолжностьПоЧастиТекста(Текст)
	
    Возврат ПолучитьДанныеВыбора(Тип("СправочникСсылка.ДолжностиОрганизаций"), 
				Новый Структура("ДополнительныеПараметры, ТекстПоиска", "ПодборПоДолжности", Текст));
	
КонецФункции
			
&НаКлиенте
Функция ПолучитьФизЛицоПоЧастиТекста(Текст)
	
    Возврат ПолучитьДанныеВыбора(Тип("СправочникСсылка.ФизическиеЛица"), Новый Структура("ВыборГруппИЭлементов, ВариантПодбора, ТекстПоиска, Должность", 
			ИспользованиеГруппИЭлементов.Элементы, "ПодборПоДолжности", Текст, ТекущаяДолжность));
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтборыОбеспеченияОбработчик()Экспорт
	
	ОбновитьОтборыОбеспечения();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборыОбеспечения(ОбновитьДолжность = Истина)Экспорт
	
	ТекущиеДанные = Элементы.Потребности.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Должность) Тогда 
		Если ОбновитьДолжность Тогда
			ТекущаяДолжность = ТекущиеДанные.Должность;
		КонецЕсли;
		КоличествоПотребность = ТекущиеДанные.Количество;
		Элементы.Обеспечение.ОтборСтрок = Новый ФиксированнаяСтруктура("Должность", ТекущаяДолжность);
	Иначе
		ТекущаяДолжность = "";
		КоличествоПотребность = 0;
		Элементы.Обеспечение.ОтборСтрок = Новый ФиксированнаяСтруктура("Должность", "Не установлен отбор");
	КонецЕсли;
	
	ОбновитьКоличествоОбеспеченияПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоОбеспеченияПодвал()
	
	КоличествоОбеспечение = Объект.Обеспечение.НайтиСтроки(Новый Структура("Должность", ТекущаяДолжность)).Количество();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЭлементовФормы()
	
	Если РольДоступна("ПолныеПрава") Тогда
		ТолькоПросмотр = Ложь;
	Иначе
		ТолькоПросмотр = Объект.Статус = Перечисления.СтатусыЗаявокНаПодборПерсонала.Обеспечена 
				ИЛИ Объект.ПометкаУдаления; 
	КонецЕсли;
	
	Элементы.Статус.ТолькоПросмотр = ТолькоПросмотр; 
	Элементы.Потребности.ИзменятьСоставСтрок = НЕ ТолькоПросмотр;
	Элементы.Потребности.ИзменятьПорядокСтрок = НЕ ТолькоПросмотр;
	
	Для каждого Колонка Из Элементы.Потребности.ПодчиненныеЭлементы Цикл
		Колонка.ТолькоПросмотр = ТолькоПросмотр;
	КонецЦикла;
	
	Для каждого Колонка Из Элементы.Обеспечение.ПодчиненныеЭлементы Цикл
		Колонка.ТолькоПросмотр = ТолькоПросмотр;
	КонецЦикла;
	
КонецПроцедуры // ОбновитьДоступностьЭлементовФормы()

&НаКлиенте
Процедура ПотребностиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.Потребности.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		Если ТекущиеДанные.Количество < КоличествоОбеспечение Тогда
			ПоказатьПредупреждение(, СтрЗаменить("Обеспечение не может превышать потребность (проверьте обеспечение по должность ТекущаяДолжность)!", "ТекущаяДолжность", ТекущаяДолжность));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;                                                                                                  
	
КонецПроцедуры

#КонецОбласти
